In [1]:
from sqlalchemy import create_engine
import pandas as pd

In [2]:
username = 'postgres'
password = ''
host = 'localhost'
# database = 'store'

store_db = create_engine(f'postgresql://{username}:{password}@{host}/store')
world_db = create_engine(f'postgresql://{username}:{password}@{host}/world')
# france_db = create_engine(f'postgresql://{username}:{password}@{host}/france')

In [3]:
df = pd.read_sql_table('countrylanguage', con=world_db)
df

    countrycode          language  isofficial  percentage
0           AFG            Pashto        True        52.4
1           NLD             Dutch        True        95.6
2           ANT        Papiamento        True        86.2
3           ALB         Albaniana        True        97.9
4           DZA            Arabic        True        86.0
..          ...               ...         ...         ...
979         IND             Asami       False         1.5
980         CAN  Eskimo Languages       False         0.1
981         CHN              Dong       False         0.2
982         RUS       Belorussian       False         0.3
983         USA        Portuguese       False         0.2

[984 rows x 4 columns]

In [13]:
len(df[df['isofficial'] == True]['language'].unique())

102

In [ ]:
df[df['isofficial'] == True]['language'].nunique()

102

In [ ]:
1. officiali filtrle
2. dillerin oldugu sutun sec
3. sutundan unikallari sayisi

In [16]:
df = pd.read_sql_table('country', con=world_db)
df

,code,name,continent,region,surfacearea,indepyear,population,lifeexpectancy,gnp,gnpold,localname,governmentform,headofstate,capital,code2
0,AFG,Afghanistan,Asia,Southern and Central Asia,652090.0,1919.0,22720000,45.9,5976.0,NaN,Afganistan/Afqanestan,Islamic Emirate,Mohammad Omar,1.0,AF
1,NLD,Netherlands,Europe,Western Europe,41526.0,1581.0,15864000,78.3,371362.0,360478.0,Nederland,Constitutional Monarchy,Beatrix,5.0,NL
2,ANT,Netherlands Antilles,North America,Caribbean,800.0,NaN,217000,74.7,1941.0,NaN,Nederlandse Antillen,Nonmetropolitan Territory of The Netherlands,Beatrix,33.0,AN
3,ALB,Albania,Europe,Southern Europe,28748.0,1912.0,3401200,71.6,3205.0,2500.0,Shqipëria,Republic,Rexhep Mejdani,34.0,AL
4,DZA,Algeria,Africa,Northern Africa,2381741.0,1962.0,31471000,69.7,49982.0,46966.0,Al-Jazair/Algérie,Republic,Abdelaziz Bouteflika,35.0,DZ
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
234,IOT,British Indian Ocean Territory,Africa,Eastern Africa,78.0,NaN,0,NaN,0.0,NaN,British Indian Ocean Territory,Dependent Territory of the UK,Elisabeth II,NaN,IO
235,SGS,South Georgia and the South Sandwich Islands,Antarctica,Antarctica,3903.0,NaN,0,NaN,0.0,NaN,South Georgia and the South Sandwich Islands,Dependent Territory of the UK,Elisabeth II,NaN,GS
236,HMD,Heard Island and McDonald Islands,Antarctica,Antarctica,359.0,NaN,0,NaN,0.0,NaN,Heard and McDonald Islands,Territory of Australia,Elisabeth II,NaN,HM
237,ATF,French Southern territories,Antarctica,Antarctica,7780.0,NaN,0,NaN,0.0,NaN,Terres australes françaises,Nonmetropolitan Territory of France,Jacques Chirac,NaN,TF
238,UMI,United States Minor Outlying Islands,Oceania,Micronesia/Caribbean,16.0,NaN,0,NaN,0.0,NaN,United States Minor Outlying Islands,Dependent Territory of the US,George W. Bush,NaN,UM

In [17]:
df.head(2)

,code,name,continent,region,surfacearea,indepyear,population,lifeexpectancy,gnp,gnpold,localname,governmentform,headofstate,capital,code2
0,AFG,Afghanistan,Asia,Southern and Central Asia,652090.0,1919.0,22720000,45.9,5976.0,NaN,Afganistan/Afqanestan,Islamic Emirate,Mohammad Omar,1.0,AF
1,NLD,Netherlands,Europe,Western Europe,41526.0,1581.0,15864000,78.3,371362.0,360478.0,Nederland,Constitutional Monarchy,Beatrix,5.0,NL

In [ ]:
1. omur sutunu sec
2. o sutunu mean

In [19]:
df['lifeexpectancy'].mean()

np.float64(66.48603603603604)

In [20]:
df = pd.read_sql_table('city', con=world_db)
df.head()

   id            name countrycode       district  population
0   1           Kabul         AFG          Kabol     1780000
1   2        Qandahar         AFG       Qandahar      237500
2   3           Herat         AFG          Herat      186800
3   4  Mazar-e-Sharif         AFG          Balkh      127800
4   5       Amsterdam         NLD  Noord-Holland      731200

In [ ]:
1. hollandiyadaki seherleri filtrle X
2. ehelileri olan sutun sec  X
3. ortalamasini hesabla

In [24]:
df[df['countrycode'] == 'NLD']['population'].mean()

np.float64(185001.75)

In [4]:
df = pd.read_sql_table('customers', con=store_db)
df.head(3)

,customerid,firstname,lastname,address1,address2,city,state,zip,country,region,email,phone,creditcardtype,creditcard,creditcardexpiration,username,password,age,income,gender
0,1,VKUUXF,ITHOMQJNYX,4608499546 Dell Way,None,QSDPAGD,SD,24101,US,1,ITHOMQJNYX@dell.com,4608499546,1,1979279217775911,2012/03,user1,password,55,100000,M
1,2,HQNMZH,UNUKXHJVXB,5119315633 Dell Way,None,YNCERXJ,AZ,11802,US,1,UNUKXHJVXB@dell.com,5119315633,1,3144519586581737,2012/11,user2,password,80,40000,M
2,3,JTNRNB,LYYSHTQJRE,6297761196 Dell Way,None,LWVIFXJ,OH,96082,US,1,LYYSHTQJRE@dell.com,6297761196,4,8728086929768325,2010/12,user3,password,47,100000,M

In [ ]:
1. OR statini filtrle
2. qadinlari filtrle
3. sayini tap

In [14]:
df_OR = df[df['state'] == 'OR']
len(df_OR[df_OR['gender'] == 'F'])

106

In [ ]:
1. OR statini filtrle VE qadinlari filtrle
3. sayini tap

In [16]:
len(df[(df['state'] == 'OR') & (df['gender'] == 'F')])

106

In [19]:
df[df['state'] == 'OR']['gender'].value_counts()

gender
M    114
F    106
Name: count, dtype: int64

In [22]:
df.head(3)

,customerid,firstname,lastname,address1,address2,city,state,zip,country,region,email,phone,creditcardtype,creditcard,creditcardexpiration,username,password,age,income,gender
0,1,VKUUXF,ITHOMQJNYX,4608499546 Dell Way,None,QSDPAGD,SD,24101,US,1,ITHOMQJNYX@dell.com,4608499546,1,1979279217775911,2012/03,user1,password,55,100000,M
1,2,HQNMZH,UNUKXHJVXB,5119315633 Dell Way,None,YNCERXJ,AZ,11802,US,1,UNUKXHJVXB@dell.com,5119315633,1,3144519586581737,2012/11,user2,password,80,40000,M
2,3,JTNRNB,LYYSHTQJRE,6297761196 Dell Way,None,LWVIFXJ,OH,96082,US,1,LYYSHTQJRE@dell.com,6297761196,4,8728086929768325,2010/12,user3,password,47,100000,M

In [ ]:
1. yash 44den boyukleri filter
2. maas 100K dan boyukleri filtre
3. adamlarin adlarini goster

In [33]:
df44 = df[df['age'] > 44]
df44[df44['income'] >= 100000][['firstname', 'lastname']]

      firstname    lastname
0        VKUUXF  ITHOMQJNYX
2        JTNRNB  LYYSHTQJRE
5        FXDZBW  BAXPEEKXVJ
8        NCGWRC  CJOPRHUHIE
14       SIQANV  QQNKJSURDA
...         ...         ...
19965    VRHIHD  DBXMVPSTKC
19968    IBPLMZ  BHEXEQBFEC
19970    IEDXER  SBJCBHSCTA
19976    ATHZGB  VJWIFUKTCN
19978    REJWXF  XYGTLBRLSG

[2497 rows x 2 columns]

In [39]:
(
    df[
    	(df['age']>44) & (df['income']>=100_000)
	]
    [['firstname', 'lastname']]
)

      firstname    lastname
0        VKUUXF  ITHOMQJNYX
2        JTNRNB  LYYSHTQJRE
5        FXDZBW  BAXPEEKXVJ
8        NCGWRC  CJOPRHUHIE
14       SIQANV  QQNKJSURDA
...         ...         ...
19965    VRHIHD  DBXMVPSTKC
19968    IBPLMZ  BHEXEQBFEC
19970    IEDXER  SBJCBHSCTA
19976    ATHZGB  VJWIFUKTCN
19978    REJWXF  XYGTLBRLSG

[2497 rows x 2 columns]

In [40]:
df.head(3)

,customerid,firstname,lastname,address1,address2,city,state,zip,country,region,email,phone,creditcardtype,creditcard,creditcardexpiration,username,password,age,income,gender
0,1,VKUUXF,ITHOMQJNYX,4608499546 Dell Way,None,QSDPAGD,SD,24101,US,1,ITHOMQJNYX@dell.com,4608499546,1,1979279217775911,2012/03,user1,password,55,100000,M
1,2,HQNMZH,UNUKXHJVXB,5119315633 Dell Way,None,YNCERXJ,AZ,11802,US,1,UNUKXHJVXB@dell.com,5119315633,1,3144519586581737,2012/11,user2,password,80,40000,M
2,3,JTNRNB,LYYSHTQJRE,6297761196 Dell Way,None,LWVIFXJ,OH,96082,US,1,LYYSHTQJRE@dell.com,6297761196,4,8728086929768325,2010/12,user3,password,47,100000,M

In [ ]:
1. 30 ve 50 yash arasini filtle
2. 50K az alanlari filter
3. ad soyad goster

In [ ]:
(
    df[
        (df['age'] >= 30) & 
        (df['age'] <= 50) & 
        (df['income'] <= 50000)
    ]
    [['firstname', 'lastname']]
)

# (
#     df.loc[
#         (df['age'] >= 30) & 
#         (df['age'] <= 50) & 
#         (df['income'] <= 50000), :
#     ]
# 	  [['firstname', 'lastname']]
# )

      firstname    lastname
3        XMFYXD  WQLQHUHLFE
9        FUOHXX  WMOEHWMMWM
31       HEJLWR  UKDLCPZCWE
32       UQBLKL  PVOFURBZMJ
65       ONGTCS  UDVEXRMKNH
...         ...         ...
19967    WCXEDL  KQUFVXLEBO
19983    HKDTGI  WUJOFDGRSY
19988    ZWQMSE  AXEDZGUJAS
19990    XHNAPF  HBXVIYJIIX
19999    WODADM  AEBUFMJAWZ

[2362 rows x 2 columns]

In [ ]:
df20_50 = df[
    (df['age'] > 20) & (df['age'] < 50)
    ]
df20_50['income'].mean()

np.float64(59409.9262407801)

In [53]:
df = pd.read_sql_table('orders', con=store_db)
df.head(3)

   orderid  orderdate  customerid  netamount    tax  totalamount
0        1 2004-01-27        7888     313.24  25.84       339.08
1        2 2004-01-01        4858      54.90   4.53        59.43
2        3 2004-01-17       15399     160.10  13.21       173.31

In [ ]:
1. 7888, 1082, 12808, 9623 filter X
2. sifarishleri goster 
3. topla

In [59]:
mask = (
	(df['customerid'] == 7888) | 
	(df['customerid'] == 1082) | 
	(df['customerid'] == 12808) | 
	(df['customerid'] == 9623)
)
df[mask]['totalamount'].sum()

np.float64(1789.05)

In [ ]:
mask = (
	df['customerid'].isin([7888, 1082, 12808, 9623])
)
df[mask]['totalamount'].sum()

In [60]:
df = pd.read_sql_table('city', world_db)
df.head(3)

   id      name countrycode  district  population
0   1     Kabul         AFG     Kabol     1780000
1   2  Qandahar         AFG  Qandahar      237500
2   3     Herat         AFG     Herat      186800

In [ ]:
1. Zuid-Holland, Noord-Brabant and Utrecht X
2. sheherleri goster
3. sheherlerin sayini tap

In [68]:
mask = (
    (df['district'] == 'Zuid-Holland') |
	(df['district'] == 'Noord-Brabant') |
	(df['district'] == 'Utrecht')
)
df[mask]['name'].count()

np.int64(12)

In [69]:
mask = df['district'].isin(['Zuid-Holland', 'Noord-Brabant', 'Utrecht'])
df[mask]['name'].count()

np.int64(12)

In [70]:
df = pd.read_sql_table('customers', store_db)
df.head(3)

,customerid,firstname,lastname,address1,address2,city,state,zip,country,region,email,phone,creditcardtype,creditcard,creditcardexpiration,username,password,age,income,gender
0,1,VKUUXF,ITHOMQJNYX,4608499546 Dell Way,None,QSDPAGD,SD,24101,US,1,ITHOMQJNYX@dell.com,4608499546,1,1979279217775911,2012/03,user1,password,55,100000,M
1,2,HQNMZH,UNUKXHJVXB,5119315633 Dell Way,None,YNCERXJ,AZ,11802,US,1,UNUKXHJVXB@dell.com,5119315633,1,3144519586581737,2012/11,user2,password,80,40000,M
2,3,JTNRNB,LYYSHTQJRE,6297761196 Dell Way,None,LWVIFXJ,OH,96082,US,1,LYYSHTQJRE@dell.com,6297761196,4,8728086929768325,2010/12,user3,password,47,100000,M

In [ ]:
# 20 <= df['age'] <= 50 # yaza bilmirik
# mask1 = (df['age'] >= 20) & (df['age'] <= 50)
mask1 = df['age'].between(20,50, inclusive='both') 
mask2 = df['income'] < 50000

df[mask1 & mask2][['firstname','lastname']]

      firstname    lastname
3        XMFYXD  WQLQHUHLFE
4        PGDTDU  ETBYBNEGUT
9        FUOHXX  WMOEHWMMWM
11       KGISQZ  IXDKAUUHCW
31       HEJLWR  UKDLCPZCWE
...         ...         ...
19983    HKDTGI  WUJOFDGRSY
19988    ZWQMSE  AXEDZGUJAS
19990    XHNAPF  HBXVIYJIIX
19998    XSKHEO  JZBOUAKOVK
19999    WODADM  AEBUFMJAWZ

[3515 rows x 2 columns]

In [83]:
df = pd.read_sql_table('country', world_db)
df.head(2)

,code,name,continent,region,surfacearea,indepyear,population,lifeexpectancy,gnp,gnpold,localname,governmentform,headofstate,capital,code2
0,AFG,Afghanistan,Asia,Southern and Central Asia,652090.0,1919.0,22720000,45.9,5976.0,NaN,Afganistan/Afqanestan,Islamic Emirate,Mohammad Omar,1.0,AF
1,NLD,Netherlands,Europe,Western Europe,41526.0,1581.0,15864000,78.3,371362.0,360478.0,Nederland,Constitutional Monarchy,Beatrix,5.0,NL

In [88]:
df['lifeexpectancy'].dropna().unique()

array([45.9, 78.3, 74.7, 71.6, 69.7, 75.1, 83.5, 38.3, 76.1, 70.5, 74.1,
       66.4, 78.4, 79.8, 62.9, 71.1, 73. , 60.2, 77.8, 70.9, 50.2, 76.9,
       52.4, 63.7, 71.5, 39.3, 77.7, 75.4, 73.6, 46.7, 46.2, 78.9, 75.7,
       75.8, 50.8, 73.4, 73.2, 63.3, 55.8, 78.8, 51.1, 45.2, 67.9, 67.5,
       50.1, 53.2, 64.5, 57.4, 79. , 68.1, 77. , 66.2, 45.6, 49. , 64. ,
       49.2, 69.9, 79.5, 68. , 62.5, 66.5, 76.8, 79.4, 78.6, 46. , 75.2,
       80.7, 59.8, 77.4, 72.4, 56.5, 54.8, 68.9, 63.2, 48. , 44. , 71.4,
       63.4, 70.3, 60. , 47.4, 48.8, 70.7, 74.4, 73.7, 76.2, 76.7, 53.1,
       68.4, 71.3, 51. , 75.5, 69.1, 77.1, 49.8, 81.6, 55. , 73.8, 37.6,
       62.2, 70.8, 77.9, 65.5, 71. , 59.5, 68.6, 67.3, 78. , 37.5, 54.9,
       42.5, 60.8, 57.8, 68.7, 41.3, 51.6, 78.7, 71.8, 61.1, 63.1, 70. ,
       75.6, 53.6, 74.8, 72.7, 79.6, 72.3, 77.6, 37.2, 69.2, 81.1, 65.3,
       67.8, 70.4, 45.3, 80.1, 74.9, 56.6, 40.4, 68.5, 64.1, 76.4, 52.3,
       76.5, 54.7, 50.5, 74.5, 60.9, 73.3, 66.3, 42.9, 66. , 72.8, 60.6,
       73.1, 67.2, 69.3, 69.5, 78.1, 37.8])

In [89]:
df = pd.read_sql_table('customers', store_db)
df.head(2)

,customerid,firstname,lastname,address1,address2,city,state,zip,country,region,email,phone,creditcardtype,creditcard,creditcardexpiration,username,password,age,income,gender
0,1,VKUUXF,ITHOMQJNYX,4608499546 Dell Way,None,QSDPAGD,SD,24101,US,1,ITHOMQJNYX@dell.com,4608499546,1,1979279217775911,2012/03,user1,password,55,100000,M
1,2,HQNMZH,UNUKXHJVXB,5119315633 Dell Way,None,YNCERXJ,AZ,11802,US,1,UNUKXHJVXB@dell.com,5119315633,1,3144519586581737,2012/11,user2,password,80,40000,M

In [100]:
mask = df['zip'].astype('string').str.contains('2')
df[mask]

,customerid,firstname,lastname,address1,address2,city,state,zip,country,region,email,phone,creditcardtype,creditcard,creditcardexpiration,username,password,age,income,gender
0,1,VKUUXF,ITHOMQJNYX,4608499546 Dell Way,None,QSDPAGD,SD,24101,US,1,ITHOMQJNYX@dell.com,4608499546,1,1979279217775911,2012/03,user1,password,55,100000,M
1,2,HQNMZH,UNUKXHJVXB,5119315633 Dell Way,None,YNCERXJ,AZ,11802,US,1,UNUKXHJVXB@dell.com,5119315633,1,3144519586581737,2012/11,user2,password,80,40000,M
2,3,JTNRNB,LYYSHTQJRE,6297761196 Dell Way,None,LWVIFXJ,OH,96082,US,1,LYYSHTQJRE@dell.com,6297761196,4,8728086929768325,2010/12,user3,password,47,100000,M
3,4,XMFYXD,WQLQHUHLFE,9862764981 Dell Way,None,HOKEXCD,MS,78442,US,1,WQLQHUHLFE@dell.com,9862764981,5,7160005148965866,2009/09,user4,password,44,40000,F
4,5,PGDTDU,ETBYBNEGUT,2841895775 Dell Way,None,RZQTCDN,AZ,16291,US,1,ETBYBNEGUT@dell.com,2841895775,3,8377095518168063,2010/10,user5,password,21,20000,M
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9986,9987,ERTGHK,QWNCOEQKET,7019880590 Dell Way,None,LLUAODY,UT,62472,US,1,QWNCOEQKET@dell.com,7019880590,2,5369383465964347,2011/01,user9987,password,84,100000,M
9993,9994,FZXYQF,YXOZLRQGEL,3983537721 Dell Way,None,ZUICBCQ,NH,10924,US,1,YXOZLRQGEL@dell.com,3983537721,3,4679468500427902,2008/02,user9994,password,74,40000,F
9996,9997,XPCJLB,ROHEZNGVWA,2874240475 Dell Way,None,SWKYZWR,LA,24757,US,1,ROHEZNGVWA@dell.com,2874240475,1,9985649213660508,2012/12,user9997,password,36,80000,M
9998,9999,WSKLKJ,ZPQIRWKPNL,6307108376 Dell Way,None,OACVSZG,LA,74402,US,1,ZPQIRWKPNL@dell.com,6307108376,2,2631467383820563,2010/07,user9999,password,74,40000,F
9999,10000,EUQOTG,ECXBNNOYCP,9593894142 Dell Way,None,BYHBEQU,PA,93129,US,1,ECXBNNOYCP@dell.com,9593894142,2,5289698296692223,2011/08,user10000,password,70,100000,F

In [104]:
'2.1..'[2]

'1'

In [103]:
'abcde'[2]

'c'

In [105]:
mask1 = df['zip'].astype('string').str.startswith('2')
mask2 = df['zip'].astype('string').str[2] == '1'

df[mask1 & mask2]

,customerid,firstname,lastname,address1,address2,city,state,zip,country,region,email,phone,creditcardtype,creditcard,creditcardexpiration,username,password,age,income,gender
0,1,VKUUXF,ITHOMQJNYX,4608499546 Dell Way,None,QSDPAGD,SD,24101,US,1,ITHOMQJNYX@dell.com,4608499546,1,1979279217775911,2012/03,user1,password,55,100000,M
39,40,WIZGFD,CPBCDTZGTD,7725075074 Dell Way,None,OUKPLXI,AL,24179,US,1,CPBCDTZGTD@dell.com,7725075074,2,7576088857371361,2012/10,user40,password,46,80000,F
89,90,HMTYMT,UVZTACMSJE,6012148553 Dell Way,None,LYPIAUX,KS,27127,US,1,UVZTACMSJE@dell.com,6012148553,4,1807652772404253,2011/12,user90,password,71,20000,F
311,312,MOFDNN,RYGLDBMJSR,1912545777 Dell Way,None,QKBDTEE,TX,27155,US,1,RYGLDBMJSR@dell.com,1912545777,2,9884611359797420,2009/09,user312,password,76,80000,F
317,318,LTFOMP,XRXTKBXKYC,3978165483 Dell Way,None,PORNXMF,NC,24160,US,1,XRXTKBXKYC@dell.com,3978165483,4,3824727247934789,2010/06,user318,password,30,100000,F
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9565,9566,ELPYPG,OVBTKLWDJX,5741209066 Dell Way,None,OWUFPGX,AL,24137,US,1,OVBTKLWDJX@dell.com,5741209066,4,8390864248387516,2009/11,user9566,password,60,60000,F
9597,9598,VOWCQD,NANSHXJGYU,9192311738 Dell Way,None,LYCUAJI,CT,25129,US,1,NANSHXJGYU@dell.com,9192311738,2,8899531215429307,2011/05,user9598,password,47,60000,M
9640,9641,MLCQNT,IJYBFJACDR,3000445278 Dell Way,None,TUFNBDO,NJ,27171,US,1,IJYBFJACDR@dell.com,3000445278,2,9601696177385748,2012/11,user9641,password,69,40000,F
9681,9682,COCWAJ,UWWQGHEFQB,9540137615 Dell Way,None,KQQOCXI,IA,23138,US,1,UWWQGHEFQB@dell.com,9540137615,3,4400187308900058,2010/04,user9682,password,24,80000,M
9728,9729,KPNTHW,XJKPDFTGQG,6122375245 Dell Way,None,RYYCCZL,SD,24134,US,1,XJKPDFTGQG@dell.com,6122375245,1,1091478947084397,2011/03,user9729,password,42,20000,M

In [106]:
df = pd.read_sql_table('customers', store_db)
df.head(2)

,customerid,firstname,lastname,address1,address2,city,state,zip,country,region,email,phone,creditcardtype,creditcard,creditcardexpiration,username,password,age,income,gender
0,1,VKUUXF,ITHOMQJNYX,4608499546 Dell Way,None,QSDPAGD,SD,24101,US,1,ITHOMQJNYX@dell.com,4608499546,1,1979279217775911,2012/03,user1,password,55,100000,M
1,2,HQNMZH,UNUKXHJVXB,5119315633 Dell Way,None,YNCERXJ,AZ,11802,US,1,UNUKXHJVXB@dell.com,5119315633,1,3144519586581737,2012/11,user2,password,80,40000,M

In [110]:
# (yash < 30 VEYA >= 50) VE income > 50000 VE Japan/Australia

mask_yash1 = df['age'] < 30
mask_yash2 = df['age'] >= 50
mask_gelir = df['income'] > 50_000
mask_olke = df['country'].isin(['Japan', 'Australia'])

df[
    (mask_yash1 | mask_yash2) 
    & mask_gelir
    & mask_olke
    ]

,customerid,firstname,lastname,address1,address2,city,state,zip,country,region,email,phone,creditcardtype,creditcard,creditcardexpiration,username,password,age,income,gender
10031,10032,KSSULQ,LBRCCTSPEI,8613195780 Dell Way,None,IBDKQIS,None,0,Australia,2,LBRCCTSPEI@dell.com,8613195780,3,9555175118613988,2010/05,user10032,password,52,80000,M
10039,10040,QFTTLQ,OYCIPFJSPA,9129135796 Dell Way,None,ENGTKMI,None,0,Japan,2,OYCIPFJSPA@dell.com,9129135796,3,9091335818637164,2009/09,user10040,password,86,100000,F
10045,10046,XWFCEZ,XQYRMHNMWH,9875332320 Dell Way,None,EDVIYZB,None,0,Australia,2,XQYRMHNMWH@dell.com,9875332320,3,3821505235973746,2010/10,user10046,password,66,60000,M
10048,10049,YTDIFQ,BMYRCXMERH,7631881897 Dell Way,None,AFATOSW,None,0,Australia,2,BMYRCXMERH@dell.com,7631881897,1,4475568006280810,2010/05,user10049,password,22,80000,F
10064,10065,JWZTFQ,WJSRPHIYBC,6178471337 Dell Way,None,LQSUGNB,None,0,Japan,2,WJSRPHIYBC@dell.com,6178471337,3,1792271003592759,2009/02,user10065,password,55,100000,F
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19975,19976,EXWTYM,TWDUMWYCNI,5533491557 Dell Way,None,CCNWXDX,None,0,Japan,2,TWDUMWYCNI@dell.com,5533491557,3,4756211382802576,2009/05,user19976,password,26,100000,M
19980,19981,ADGPYF,KMOHRIWDYM,9396769931 Dell Way,None,FAYKDQA,None,0,Australia,2,KMOHRIWDYM@dell.com,9396769931,4,3095722363330424,2008/05,user19981,password,52,60000,F
19985,19986,GIMCJC,HXYQTLQMOW,8442474245 Dell Way,None,KRUILZR,None,0,Australia,2,HXYQTLQMOW@dell.com,8442474245,1,8532942456658930,2012/09,user19986,password,19,60000,M
19987,19988,KEENNV,NNFADBBQJU,2632857975 Dell Way,None,XZXFHDH,None,0,Japan,2,NNFADBBQJU@dell.com,2632857975,2,7616681312210859,2009/09,user19988,password,77,80000,F
19996,19997,GSGAVT,SWRJHDYMQA,3311555452 Dell Way,None,VEGNPKT,None,0,Australia,2,SWRJHDYMQA@dell.com,3311555452,4,2423516578041017,2008/06,user19997,password,73,60000,M

In [111]:
df = pd.read_sql_table('orders', store_db)
df.head(2)

   orderid  orderdate  customerid  netamount    tax  totalamount
0        1 2004-01-27        7888     313.24  25.84       339.08
1        2 2004-01-01        4858      54.90   4.53        59.43

In [117]:
mask1 = df['orderdate'] == '2004-06'
mask2 = df['netamount'] >= 100
df[mask1 & mask2]['totalamount'].sum()

np.float64(7128.32)

In [128]:
df = pd.DataFrame({
	'Team': ['A', 'A', 'B', 'B', 'C', 'C'],
	'Points': [10, 15, 10, 20, 10, 5],
	'Assists': [5, 7, 5, 10, 5, 2]
})
df

  Team  Points  Assists
0    A      10        5
1    A      15        7
2    B      10        5
3    B      20       10
4    C      10        5
5    C       5        2

In [129]:
def f(balaca_df):
    assists_sum = balaca_df['Assists'].sum()
    if assists_sum > 10:
        balaca_df['Points'] = balaca_df['Points'] * 2
    return balaca_df

df.groupby('Team', group_keys=False).apply(f)

C:\Users\user\AppData\Local\Temp\ipykernel_13392\1994842982.py:7: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df.groupby('Team', group_keys=False).apply(f)

  Team  Points  Assists
0    A      20        5
1    A      30        7
2    B      20        5
3    B      40       10
4    C      10        5
5    C       5        2

In [ ]:
df_balaca = df.groupby('Team').get_group('A')
assists_sum = df_balaca['Assists'].sum()
if assists_sum > 10:
    df_balaca['Points'] = df_balaca['Points'] * 2
df_balaca

  Team  Points  Assists
0    A      20        5
1    A      30        7
2    B      20        5
3    B      40       10
4    C      20        5
5    C      10        2